In [5]:
import pandas as pd
from IPython.display import display

csv_data = pd.read_csv("https://dqlab-dataset.s3-ap-southeast-1.amazonaws.com/shopping_data.csv")
csv_data.to_csv(r"D:\Usep Syaikal Arifin\Computer Programming\Application File\Application File PT Bukit Makmur Mandiri Utama (BUMA)\Kelas Fundamental\Data Wrangling Python\File Dokumentasi\File CSV\shopping_data.csv", index=None, header=True)
csv_data.to_excel(r"D:\Usep Syaikal Arifin\Computer Programming\Application File\Application File PT Bukit Makmur Mandiri Utama (BUMA)\Kelas Fundamental\Data Wrangling Python\File Dokumentasi\File Excel\shopping_data.xlsx", index=None, header=True)

display(csv_data.head())
display(csv_data["Age"])
display(csv_data.iloc[4])

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

0      19
1      21
2      20
3      23
4      31
       ..
195    35
196    45
197    32
198    32
199    30
Name: Age, Length: 200, dtype: int64

CustomerID                     5
Genre                     Female
Age                           31
Annual Income (k$)            17
Spending Score (1-100)        40
Name: 4, dtype: object

In [8]:
display(csv_data["Age"].iloc[1])
display(csv_data.head())
display(csv_data.iloc[0:5])

21

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [10]:
display(csv_data.describe())

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

In [17]:
csv_data = pd.read_csv("https://dqlab-dataset.s3-ap-southeast-1.amazonaws.com/shopping_data_missingvalue.csv")
csv_data.to_csv(r"D:\Usep Syaikal Arifin\Computer Programming\Application File\Application File PT Bukit Makmur Mandiri Utama (BUMA)\Kelas Fundamental\Data Wrangling Python\File Dokumentasi\File CSV\shopping_data_missingvalue.csv", index=None, header=True)
csv_data.to_excel(r"D:\Usep Syaikal Arifin\Computer Programming\Application File\Application File PT Bukit Makmur Mandiri Utama (BUMA)\Kelas Fundamental\Data Wrangling Python\File Dokumentasi\File Excel\shopping_data_missingvalue.xlsx", index=None, header=True)

display(csv_data.info())
display(csv_data.head())
display(csv_data.isnull().values.any())
display(csv_data.isnull().sum())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Genre                   200 non-null    object
 2   Age                     199 non-null    float64
 3   Annual Income (k$)      198 non-null    float64
 4   Spending Score (1-100)  198 non-null    float64
dtypes: float64(3), int64(1), object(1)
memory usage: 7.9+ KB

None

   CustomerID   Genre   Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male  19.0                15.0                    39.0
1           2    Male   NaN                15.0                    81.0
2           3  Female  20.0                 NaN                     6.0
3           4  Female  23.0                16.0                    77.0
4           5  Female  31.0                17.0                     NaN

True

CustomerID                0
Genre                     0
Age                       1
Annual Income (k$)        2
Spending Score (1-100)    2
dtype: int64

In [37]:
csv_data = pd.read_csv("https://dqlab-dataset.s3-ap-southeast-1.amazonaws.com/shopping_data_missingvalue.csv")

numeric_columns = list(csv_data.dtypes[csv_data.dtypes != "object"].index)

display(csv_data[numeric_columns].mean())
csv_data[numeric_columns] = csv_data[numeric_columns].fillna(csv_data[numeric_columns].mean())
display(csv_data.isnull().sum())

CustomerID                100.500000
Age                        38.939698
Annual Income (k$)         61.005051
Spending Score (1-100)     50.489899
dtype: float64

CustomerID                0
Genre                     0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

In [39]:
csv_data = pd.read_csv("https://dqlab-dataset.s3-ap-southeast-1.amazonaws.com/shopping_data_missingvalue.csv")

numeric_columns = list(csv_data.dtypes[csv_data.dtypes != "object"].index)

display(csv_data[numeric_columns].median())
csv_data[numeric_columns] = csv_data[numeric_columns].fillna(csv_data[numeric_columns].median())
display(csv_data.isnull().sum())

CustomerID                100.5
Age                        36.0
Annual Income (k$)         62.0
Spending Score (1-100)     50.0
dtype: float64

CustomerID                0
Genre                     0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

In [43]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import MinMaxScaler

csv_data = pd.read_csv("https://dqlab-dataset.s3-ap-southeast-1.amazonaws.com/shopping_data.csv")
feature_columns = list(csv_data.dtypes[csv_data.dtypes != "object"].index)
feature_columns.remove("CustomerID")
X = csv_data[feature_columns]

min_max_scaler = MinMaxScaler()
data = min_max_scaler.fit_transform(X)

array = csv_data.values
dataset = pd.DataFrame({
                        "Customer ID" : array[:,0],
                        "Gender" : array[:,1],
                        "Age" : data[:,0],
                        "Income" : data[:,1],
                        "Spending Score" : data[:,2]
                      })
display(dataset.head())

  Customer ID  Gender       Age    Income  Spending Score
0           1    Male  0.019231  0.000000        0.387755
1           2    Male  0.057692  0.000000        0.816327
2           3  Female  0.038462  0.008197        0.051020
3           4  Female  0.096154  0.008197        0.775510
4           5  Female  0.250000  0.016393        0.397959